Revit 2024 API
Entity.Schema Property
 The Schema describing this Entity.
Namespace: Autodesk.Revit.DB.ExtensibleStorage
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2012
Syntax
C#
public Schema Schema { get; }
Visual Basic
Public ReadOnly Property Schema As Schema
	Get
Visual C++
public:
property Schema^ Schema {
	Schema^ get ();
}
See Also
Entity Class
Autodesk.Revit.DB.ExtensibleStorage Namespace